# GetHashCode Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetId..::..GetHashCode Method
WorksetId Class See Also
---
Gets the integer value of the id as hash code
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int GetHashCode()
```

Visual Basic
---
```text
Public Overrides Function GetHashCode As Integer
```

Visual C++
---
```text
public:
virtual int GetHashCode() override
```

# See Also
WorksetId Class
Autodesk.Revit.DB Namespace